#Напишите программу, которая принимает на вход цифру, обозначающую день недели,
#и проверяет, является ли этот день выходным.

day = int(input('Введите день недели '))

if day == 1:
    print('Это не выходной')
elif day == 2:
    print('Это не выходной')
elif day == 3:
    print('Это не выходной')
elif day == 4:
    print('Это не выходной')
elif day == 5:
    print('Это не выходной')
elif day == 6:
    print('Это выходной')
elif day == 7:
    print('Это выходной')
else:
    print('Ошибка')